backend-api/app/Controllers/Auth.php

    public function login()
    {
        $username = $this->request->getJSON()->username ?? '';
        $password = $this->request->getJSON()->password ?? '';

        $userModel = new UserModel();

        $user = $userModel
            ->where('username', $username)
            ->first();

        if (!$user) {
            return $this->failUnauthorized('Username tidak ditemukan');
        }

        if (!password_verify($password, $user['password'])) {
            return $this->failUnauthorized('Password salah');
        }

        $token = bin2hex(random_bytes(32));

        $userModel->update($user['id'], [
            'token' => $token
        ]);
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
UPDATE `users` SET `token` = '54d0798030e890782a601be7d9d207dab26fea66f2f3ed0c093e2b63402acbf6'
WHERE `users`.`id` IN ('1')