backend-api/app/Controllers/Barang.php

SELECT `barang`.*, `kategori`.`nama_kategori`, `supplier`.`nama_supplier`
FROM `barang`
JOIN `kategori` ON `kategori`.`id` = `barang`.`kategori_id`
JOIN `supplier` ON `supplier`.`id` = `barang`.`supplier_id`
---
    public function index()
    {
        $db = \Config\Database::connect();

        $data = $db->table('barang')
            ->select('
                barang.*,
                kategori.nama_kategori,
                supplier.nama_supplier
            ')
            ->join('kategori', 'kategori.id = barang.kategori_id')
            ->join('supplier', 'supplier.id = barang.supplier_id')
            ->get()
            ->getResult();