backend-api/app/Controllers/Dashboard.php

    public function index()
    {
        $db = \Config\Database::connect();

        $totalBarang = $db->table('barang')
            ->countAllResults();

        $totalKategori = $db->table('kategori')
            ->countAllResults();

        $totalSupplier = $db->table('supplier')
            ->countAllResults();

        $totalStok = $db->table('barang')
            ->selectSum('stok')
            ->get()
            ->getRow()
            ->stok ?? 0;

        $barangMasuk = $db->table('histori_stok')
            ->selectSum('jumlah')
            ->where('jenis', 'masuk')
            ->get()
            ->getRow()
            ->jumlah ?? 0;

        $barangKeluar = $db->table('histori_stok')
            ->selectSum('jumlah')
            ->where('jenis', 'keluar')
            ->get()
            ->getRow()
            ->jumlah ?? 0;
---
SELECT COUNT(*) AS `numrows`
FROM `barang`
SELECT COUNT(*) AS `numrows`
FROM `kategori`
SELECT COUNT(*) AS `numrows`
FROM `supplier`
SELECT SUM(`stok`) AS `stok`
FROM `barang`
SELECT SUM(`jumlah`) AS `jumlah`
FROM `histori_stok`
WHERE `jenis` = 'masuk'
SELECT SUM(`jumlah`) AS `jumlah`
FROM `histori_stok`
WHERE `jenis` = 'keluar'