backend-api/app/Controllers/Histori.php

SELECT `histori_stok`.*, `barang`.`nama_barang`
FROM `histori_stok`
JOIN `barang` ON `barang`.`id` = `histori_stok`.`barang_id`
ORDER BY `histori_stok`.`id` DESC
---
    public function index()
    {
        $db = \Config\Database::connect();

        $data = $db->table('histori_stok')
            ->select('
                histori_stok.*,
                barang.nama_barang
            ')
            ->join('barang', 'barang.id = histori_stok.barang_id')
            ->orderBy('histori_stok.id', 'DESC')
            ->get()
            ->getResult();

SELECT *
FROM `barang`
WHERE `barang`.`id` = '3'
---
    public function create()
    {
        $data = $this->request->getJSON(true);

        $barangModel = new BarangModel();

        $barang = $barangModel->find($data['barang_id']);

UPDATE `barang` SET `stok` = 60
WHERE `barang`.`id` IN ('3')
---

        $this->model->insert($data);

        $barangModel->update(
            $barang['id'],
            ['stok' => $stokBaru]
        );