backend-api/app/Filters/AuthToken.php

SELECT *
FROM `users`
WHERE `token` = 'a78a891db13920fc37dc244f1848b55a19fffa091c639e1a70a140e5a592643d'
 LIMIT 1
---
    public function before(RequestInterface $request, $arguments = null)
    {
        $header = $request->getHeaderLine('Authorization');

        if (!$header) {
            return service('response')
                ->setJSON([
                    'status' => false,
                    'message' => 'Token tidak ditemukan'
                ])
                ->setStatusCode(401);
        }

        $token = str_replace('Bearer ', '', $header);

        $userModel = new UserModel();

        $user = $userModel
            ->where('token', $token)
            ->first();